/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0726/homework2/tools.c
 * @brief        : 通用工具函数的实现文件，提供清屏、等待、输入处理等功能
 * @date         : 2024-07-27 10:28:18
 * @version      : 1.0
 * @author       : a_23456@foxmail.com
 * @note         : 实现清屏、暂停等待、字符输入、字符串输入和数字输入等函数
 * @Copyright    : (c) 2024-2025 a_23456@foxmail.com All Right Reserved
 *****************************************************************************************************************************************************************/

#include "tools.h"
#include <string.h>

/****************************************************************************************************************************************************************
 * @name         : clearBuffer
 * @brief        : 清空输入缓冲区，防止多余输入影响后续操作
 * @return       : 无
 * @date         : 2024-07-27 10:25:11
 * @version      : 1.0
 *****************************************************************************************************************************************************************/
void clearBuffer() {
  int c;
  while ((c = getchar()) != '\n' && c != EOF)
    ; // 循环读取并丢弃输入缓冲区中的字符，直到遇到换行符或文件结束符
}

/****************************************************************************************************************************************************************
 * @name         : pauseWait
 * @brief        : 暂停等待用户输入，常用于提示信息后的等待
 * @return       : 无
 * @date         : 2024-07-27 10:25:23
 * @version      : 1.0
 *****************************************************************************************************************************************************************/
void pauseWait() {
  // printf("按任意键继续...\n");
  clearBuffer();
}

/****************************************************************************************************************************************************************
 * @name         : inputCharacters
 * @brief        : 从标准输入读取一个字符
 * @return       : 返回读取的字符
 * @date         : 2024-07-27 10:57:35
 * @version      : 1.0
 *****************************************************************************************************************************************************************/
char inputCharacters() {
  char buffer[20];
  if (inputString(buffer, sizeof(buffer))) {
    if (buffer[0] != '\0') {
      return buffer[0]; // 返回读取的第一个字符
    }
  }
  return '\0'; // 默认返回空字符
}

/****************************************************************************************************************************************************************
 * @name         : inputString
 * @brief        : 从标准输入读取一个字符串，并存储在缓冲区中
 * @param        : char *buffer - 存储输入字符串的缓冲区
 * @param        : unsigned int num - 缓冲区的大小
 * @return       : 成功返回true，失败返回false
 * @date         : 2024-07-27 11:01:48
 * @version      : 1.0
 *****************************************************************************************************************************************************************/
bool inputString(char *buffer, unsigned int num) {
  const char *quitCommands[] = {"!q", "！q", "!Q", "！Q"};
  size_t numQuitCommands = sizeof(quitCommands) / sizeof(quitCommands[0]);

  if (fgets(buffer, num, stdin) != NULL) {
    size_t len = strlen(buffer);
    if (len > 0 && buffer[len - 1] == '\n') {
      buffer[len - 1] = '\0'; // 删除换行符
    } else {
      clearBuffer(); // 清空输入缓冲区，防止输入过长影响后续操作
    }

    printf("\n");

    for (size_t i = 0; i < numQuitCommands; ++i) {
      if (strcasecmp(buffer, quitCommands[i]) == 0) {
        longjmp(back_env, 1); // 跳出阻塞调用并返回主函数
      }
    }

    return true; // 成功读取字符串
  }

  printf("发生意料之外的错误！\n");
  exit(1);
}

/****************************************************************************************************************************************************************
 * @name         : inputNumber
 * @brief        : 从标准输入读取一个整数
 * @return       : 返回读取的整数
 * @date         : 2024-07-27 11:15:15
 * @version      : 1.0
 *****************************************************************************************************************************************************************/
int inputNumber() {
  char buffer[20];
  while (true) {
    if (inputString(buffer, sizeof(buffer))) {
      char *endptr;
      long number = strtol(buffer, &endptr, 10);
      if (endptr != buffer && *endptr == '\0') {
        return (int)number;
      } else {
        printf("输入无效，请输入一个有效的数字：");
      }
    }
  }
}

/****************************************************************************************************************************************************************
 * @name: printCenteredField
 * @brief: 打印居中对齐的字段
 * @param {char} *field - 要打印的字段内容
 * @param {int} fieldWidth - 字段宽度
 * @return: void
 * @date: 2024-07-28 18:59:52
 * @version: 1.0
 * @note: 如果字段宽度是奇数，右侧会多填充一个空格
 *****************************************************************************************************************************************************************/
void printCenteredField(const char *field, int fieldWidth) {
  int fieldLength = strlen(field);
  int padding = (fieldWidth - fieldLength) / 2;
  printf("%*s%s%*s", padding, "", field, padding, "");
  if ((fieldWidth - fieldLength) % 2 != 0) {
    printf(" "); // 如果是奇数，右侧多填充一个空格
  }
}
