/****************************************************************************************************************************************************************
 * @file         : /0709/demo3.c
 * @brief        : 小练习：利用printf输出下面不同类型的常量
                    整型常量 : 10  20  30         👉   %d
                    八进制整型常量: 017 , 028      👉  %o
                    十六进制整型常量:0xab , 0x1f   👉  %x
                    字符常量: 'a','Q' ,'w'        👉  %c
                    字符串常量:"abcd" , "你好帅"   👉  %s
                    浮点型常量:3.14 ,2.33 ,15.6   👉  %f
                    双精度浮浮点常量:3123.1234512  👉  %lf
                    指数常量：1.0e10              👉  %e
                    地址常量:0xab1e3fad           👉  %p
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-09 15:05:58
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2023-2024   a_23456@foxmail.com   All Right Reserved
*****************************************************************************************************************************************************************/
#include <stdio.h>
int main(int argc, const char *argv[]) {
  printf("整型常量: 10 20 30 👉 %%d %d %d %d\n", 10, 20, 30);
  printf("八进制整型常量: 017 027 👉 %%o %o %o \n", 017, 027);
  printf("十六进制整型常量: 0xab 0x1f 👉 %%x %x %x \n", 0xab, 0x1f);
  printf("字符串常量: \"abcd\" \"你好帅\" 👉 %%s %s %s\n", "abcd", "你好帅");
  printf("字符常量: 'a' 'Q' 'w' 👉 %%c %c %c %c\n", 'a', 'Q', 'w');
  printf("浮点型常量: 3.14 2.33 15.6 👉 %%f %f %f %f \n", 3.14, 2.33, 15.6);
  printf("双精度浮浮点常量: 3123.1234512 👉 %%lf %lf \n", 3123.1234512);
  printf("指数常量: 1.0e10 👉 %%e %e \n", 1.0e10);
  printf("地址常量: 0xab1e3fad 👉 %%p %p \n", (void *)0xab1e3fad);
  return 0;
}