/****************************************************************************************************************************************************************
 * @file         : /user/Code/ClassWork/0709/demo1.c
 * @brief        :
 *这个程序演示了如何去除字符串中的空格，并打印处理后的字符串。主要使用了动态内存分配和指针操作。
 *                 输入的字符串可以包含空格，输出的字符串将去除所有空格后进行打印。
 *                 如果输入字符串全是空格，将输出空字符串。
 *                 确保输入字符串在处理后释放分配的内存，避免内存泄漏。
 *                 注意：在实际应用中，为了安全起见，应该添加对内存分配成功与否的检查。
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-09 10:39:58
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c) 2023-2024 a_23456@foxmail.com All Right Reserved
 *****************************************************************************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/****************************************************************************************************************************************************************
 * @name: strip
 * @brief: 去除字符串中的空格并打印处理后的字符串。
 * @param {char *} str - 要处理的输入字符串。
 * @return {*}
 * @date: 2024-07-09 10:42:13
 * @version: 1.0
 * @note: 函数内部使用动态内存分配来存储处理后的字符串，确保原始字符串不被修改。
 *****************************************************************************************************************************************************************/
void strip(char *str) {
  char *temp =
      (char *)malloc(strlen(str) + 1); // 分配足够的内存存储处理后的字符串
  char *original_temp = temp; // 保存初始指针位置

  while (*str != '\0') {
    if (*str != ' ') {
      *temp = *str; // 复制非空格字符到临时字符串中
      temp++;
    }
    str++; // 移动到下一个字符
  }

  *temp = '\0';                  // 添加字符串结尾标志
  printf("%s\n", original_temp); // 打印处理后的字符串
  free(original_temp);           // 释放动态分配的内存
}

int main() {
  char input1[] = "  Hello,  World!  ";
  strip(input1); // 调用函数去除空格并打印结果
  char input2[] = "  ";
  strip(input2); // 调用函数去除空格并打印结果
  return 0;
}
