/****************************************************************************************************************************************************************
 * @file         : /Tools/home/user/Code/ClassWork/0723/demo3/main.c
 * @brief        : 小练习：编写一个递归函数实现 1+2+3+4+5……+n
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-23 14:51:38
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

/****************************************************************************************************************************************************************
 * @name: sumToN
 * @brief: 计算从1加到n的和
 * @param {int} n 要计算的数值n
 * @return {int} 从1加到n的和
 * @date: 2024-07-23 16:50:33
 * @version: 1.0
 * @note:
 *****************************************************************************************************************************************************************/
int sumToN(int n) {
  // 基本情况，如果n为1，返回1
  if (n == 1) {
    return 1;
  }
  // 递归调用，计算n加上从1到n-1的和
  return n + sumToN(n - 1);
}

/****************************************************************************************************************************************************************
 * @name: sumRange
 * @brief: 计算从i加到j的和
 * @param {int} start 起始值
 * @param {int} end 终止值
 * @return {int} 从start加到end的和
 * @date: 2024-07-23 16:50:33
 * @version: 1.0
 * @note:
 *****************************************************************************************************************************************************************/
int sumRange(int start, int end) {
  // 基本情况，如果start等于end，返回end
  if (start == end) {
    return end;
  }
  // 递归调用，计算start加上从start+1到end的和
  return start + sumRange(start + 1, end);
}

int main(int argc, const char *argv[]) {
  // 测试sumToN函数，计算1到10的和
  printf("sumToN 求1到%d的和是%d\n", 10, sumToN(10));

  // 测试sumRange函数，计算1到10的和
  printf("sumRange 求%d到%d的和是%d\n", 1, 10, sumRange(1, 10));

  return 0;
}
