/****************************************************************************************************************************************************************
 * @file         : /DineSimple/include/UI/ui.h
 * @brief        : UI 层对象定义
 * @author       : a_23456@foxmail.com
 * @date         : 2024-08-16 16:24:08
 * @version      : 1.0
 * @note         : 定义了 UI 层的结构体和相关操作函数
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#ifndef UI_H
#define UI_H

#include "../Tools/font.h"

/* 界面状态枚举 */
typedef enum {
  WELCOME_SCREEN,       // 欢迎页
  MENU_SCREEN,          // 点菜页面
  USER_LOGIN_SCREEN,    // 用户登录页面
  ORDER_HISTORY_SCREEN, // 用户点餐记录页
  SHOPPING_CART_SCREEN, // 用户购物车页
  EXIT                  //退出
} ScreenState;

/* UI 组件结构体 */
typedef struct {
  int *lcd_mmap;              // 映射到 LCD 的内存指针
  int input;                  // 触摸屏设备文件描述符
  font *font;                 // 字体文件描述符
  char time_str[50];          // 用于显示时间
  int ts_x;                   // 用于记录触摸屏的坐标X
  int ts_y;                   // 用于记录触摸屏的坐标Y
  ScreenState currentScreen;  // 当前显示的屏幕状态
  ScreenState previousScreen; // 上一个屏幕状态
} UI;

/****************************************************************************************************************************************************************
 * @name: show_boot_animation
 * @brief: 显示开机动画
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @param {const char*} frame_path - 图片帧路径
 * @param {int} frame_count - 图片帧的数量
 * @return: void
 * @note: 该函数负责显示开机动画。开机动画在 UI 初始化时调用。
 *****************************************************************************************************************************************************************/
void show_boot_animation(UI *ui, const char *frame_path, int frame_count);

/****************************************************************************************************************************************************************
 * @name: show_WelcomeScreen
 * @brief: 显示欢迎页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示欢迎页
 *****************************************************************************************************************************************************************/
void show_WelcomeScreen(UI *ui);

/****************************************************************************************************************************************************************
 * @name: show_UserLoginScreen
 * @brief: 显示用户登录页面
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户登录页面
 *****************************************************************************************************************************************************************/
void show_UserLoginScreen(UI *ui);

/****************************************************************************************************************************************************************
 * @name: show_MenuScreen
 * @brief: 显示点菜页面
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示点菜页面
 *****************************************************************************************************************************************************************/
void show_MenuScreen(UI *ui);

/****************************************************************************************************************************************************************
 * @name: show_ShoppingCartScreen
 * @brief: 显示用户购物车页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户购物车页
 *****************************************************************************************************************************************************************/
void show_ShoppingCartScreen(UI *ui);

/****************************************************************************************************************************************************************
 * @name: show_OrderHistoryScreen
 * @brief: 显示用户点餐记录页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户点餐记录页
 *****************************************************************************************************************************************************************/
void show_OrderHistoryScreen(UI *ui);

/****************************************************************************************************************************************************************
 * @name: handle_Exit
 * @brief: 处理退出逻辑
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责处理退出逻辑并释放资源
 *****************************************************************************************************************************************************************/
void handle_Exit(UI *ui);

#endif // UI_H
