/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0712/demo1.c
 * @brief        : 小练习：求输出一个数据上的每一位（利用 >>=）
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-12 10:52:07
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {

  unsigned int number;

  // 提示用户输入一个无符号整数
  printf("请输入一个数: ");
  scanf("%u", &number); // 例如输入24，二进制为0001 1000

  // 输出输入数字的十六进制表示
  printf("%u的十六进制是 ==> %0#10X\n", number, number);

  // 输出输入数字的二进制表示
  printf("%u的二进制是 ==> ", number);

  // 输出当前数字的最低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的次低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第三低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第四低位
  printf("%u ", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第五低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第六低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第七低位
  printf("%u", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  // 输出当前数字的第八低位
  printf("%u\n", number & 0x01);
  number >>= 0x01; // 将数字右移一位

  return 0;
}
