/****************************************************************************************************************************************************************
 * @file         : /Tools/home/user/Code/ClassWork/0724/demo5/main.c
 * @brief        :
 *                 小练习：定义两个带参宏定义，一个求两个数据中较大的值，另一个求两个数据中较小的值。
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-24 16:25:01
 * @version      : 1.0
 * @note         : (c) 2024-2025 a_23456@foxmail.com All Rights Reserved
 *****************************************************************************************************************************************************************/
#include <stdio.h>

// 定义求两个数据中较大值的宏
#define MAX(a, b) ((a) > (b) ? (a) : (b))

// 定义求两个数据中较小值的宏
#define MIN(a, b) ((a) < (b) ? (a) : (b))

int main(int argc, const char *argv[]) {
  // 测试宏定义MAX和MIN
  int num1 = 15;
  int num2 = 17;
  int num3 = -15;
  int num4 = -17;

  // 输出两个正数中的较大值
  printf("求(%d, %d)两个数的最大值：%d\n", num1, num2, MAX(num1, num2));
  // 输出两个负数中的较小值
  printf("求(%d, %d)两个数的最小值：%d\n", num3, num4, MIN(num3, num4));

  return 0;
}
