/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo4.c
 * @brief        :
 *                 小练习：将姓名赋值给字符串数组并输出（注意：一个汉字占用多个字符，ASCII表中没有汉字）
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 11:34:36
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>
#include <string.h>

int main() {
  char name
      [10]; // 定义一个足够存储姓名的字符数组，例如"张三"需要3个字符加上结尾的'\0'
  strcpy(name, "张三"); // 将姓名赋值给数组

  printf("%s\n", name); // 输出姓名

  return 0;
}
