/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo1.c
 * @brief        : 小练习：定义一个缺省数组，并输出该数组所有元素的值
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 10:21:29
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main() {
  // 定义一个包含5个元素的整数数组，并初始化
  int array[5] = {1, 2, 3, 4, 5};

  // 输出数组所有元素的值
  printf("数组所有元素的值为：\n");
  for (int i = 0; i < sizeof(array) / sizeof(array[0]); i++) {
    printf("%d ", array[i]); // 打印每个元素的值
  }
  printf("\n");

  return 0;
}