/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo8.c
 * @brief        : 小练习：将一个字符串数组转换成整数存储为 0x12345678
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 16:48:23
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main() {
  char str[4];

  // 按照字节赋值，以实现存储为 0x12345678
  str[0] = 0x12;
  str[1] = 0x34;
  str[2] = 0x56;
  str[3] = 0x78;

  // 将字符数组 str 转换为整数
  int *p = (int *)str;
  int value = *p;

  printf("转换后的整数值为：%0#10x\n", value); // 输出转换后的整数值

  return 0;
}
