/***********************************************************************************************
 * @file         : demo2.c
 * @brief        : 小练习：定义一个二维数组，并根据行与列输出所有元素
 * @date         : 2024-07-17
 * @version      : 1.0
 * @note         :
 * @author       
 *                a_23456@foxmail.com
 ***********************************************************************************************/

#include <stdio.h>

int main() {
    // 定义一个包含4行5列的二维整数数组，并初始化
    int array[][5] = {
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5}
    };

    // 输出数组所有元素的值
    for (int i = 0; i < sizeof(array) / sizeof(array[0]); i++) {
        for (int j = 0; j < sizeof(array[0]) / sizeof(int); j++) {
            printf("%d ", array[i][j]);  // 打印每个元素的值
        }
        printf("\n");  // 换行，输出下一行的元素
    }

    return 0;
}
