/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo3.c
 * @brief        :
 *                 小练习：定义一个变长数组，根据用户输入大小并录入元素，并输出所有元素
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 11:12:41
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/
#include <stdio.h>

int main() {
  unsigned int arraySize = 0;
  printf("请设置数组大小(非负整数)：");
  scanf("%u", &arraySize); // 接收用户输入的数组大小

  // 根据用户输入的大小定义数组
  signed int array[arraySize];

  // 循环录入数组元素
  for (int i = 0; i < arraySize; i++) {
    printf("请为数组第%d个元素赋值：", i + 1);
    scanf("%d", &array[i]); // 接收用户输入的数组元素值
  }
  printf("数组已赋值完成!\n");

  // 输出数组所有元素的值
  printf("数组所有元素的值为：\n");
  for (int i = 0; i < arraySize; i++) {
    printf("%d ", array[i]); // 打印每个元素的值
  }
  printf("\n");

  return 0;
}
