/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo6.c
 * @brief        : 小练习：定义一个字符串数组，存储5个同学的中文姓名，并循环输出
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 14:41:13
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main() {
  char array
      [5]
      [50]; // 定义一个二维字符数组，存储5个同学的姓名，每个姓名最长为49个字符

  // 循环接收用户输入的姓名
  for (int i = 0; i < sizeof(array) / sizeof(array[0]); i++) {
    printf("请为第%d个同学设置名字：", i + 1);
    scanf("%s", array[i]); // 接收用户输入的姓名
  }

  // 循环输出存储的姓名
  for (int i = 0; i < sizeof(array) / sizeof(array[0]); i++) {
    printf("第%d个同学的名字是：%s\n", i + 1, array[i]); // 输出每个同学的姓名
  }

  return 0;
}
