/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0717/demo5.c
 * @brief        :
 *                 小练习：获取用户输入的字符串，将小写字母改为大写后输出
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 14:13:52
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>
#include <string.h>

int main() {
  char str[1024];
  printf("请任意输入一些字符串：");
  scanf("%s", str); // 接收用户输入的字符串

  for (int i = 0; i < strlen(str); i++) {
    if (str[i] >= 'a' && str[i] <= 'z') {
      str[i] = str[i] - 32; // 将小写字母转换为对应的大写字母
    }
  }

  printf("转换后的字符串为：%s\n", str); // 输出转换后的字符串

  return 0;
}
