/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0716/demo1.c
 * @brief        : 小练习：定义一个大小为5个short的数组，并初始化
 *                 初始化一个包含5个short类型元素的数组，元素依次为0, 1, 2, 3, 4
 *                 演示了如何声明数组并初始化其元素
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-16 14:30:54
 * @version      : 1.0
 * @note         :
 *                 无特殊说明，句法无错
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    signed short int array[5] = {0, 1, 2, 3, 4}; // 声明并初始化一个包含5个short类型元素的数组
    // 数组下标从0开始，分别对应元素为：array[0]=0, array[1]=1, array[2]=2, array[3]=3, array[4]=4
    
    // 可以在这里添加代码来使用数组，例如输出数组元素的值
    for (int i = 0; i < 5; ++i) {
        printf("array[%d] = %d\n", i, array[i]);
    }
    
    return 0;
}
