/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0716/homework1.c
 * @brief        : 作业1：计算一个数组中所有元素的和
 *                 演示了如何计算二维数组所有元素的和，并输出每个元素及总和。
 * @date         : 2024-07-16 17:25:38
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    // 声明并初始化一个10x10的整型二维数组
    signed int array[10][10];

    // 使用循环对数组进行赋值，并计算所有元素的和
    int sum = 0;
    for (int i = 0; i < 10; i++) {
        for (int j = 0; j < 10; j++) {
            array[i][j] = i * 10 + j; // 初始化数组元素
            sum += array[i][j];       // 累加计算数组元素的和
        }
    }

    // 输出数组内容及所有元素的和
    printf("二维数组内容如下:\n");
    for (int i = 0; i < 10; i++) {
        for (int j = 0; j < 10; j++) {
            printf("%-3d ", array[i][j]); // 输出每个元素
        }
        printf("\n");
    }

    printf("数组中所有元素的和是：%d\n", sum); // 输出所有元素的和

    return 0;
}
