/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0716/homework8.c
 * @brief        : 作业：计算一个二维数组中所有元素的和
 *                 给定一个5x5的整型二维数组，计算所有元素的和并输出。
 * @date         : 2024-07-16 21:45:37
 * @version      : 1.0
 * @note         : 这个程序演示了如何计算一个二维数组中所有元素的和，并输出结果。
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    signed int sum = 0;
    signed int array[5][5] = {
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5}
    };

    // 计算二维数组中所有元素的和
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
            sum += array[i][j];
        }
    }

    // 输出计算结果
    printf("二维数组中所有元素的和为：%d\n", sum);

    return 0;
}
