/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0716/homework10.c
 * @brief        : 作业：翻转一个二维数组中的所有元素
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 09:50:18
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/
/****************************************************************************************************************************************************************
 * @file         : homework10.c
 * @brief        : 作业：翻转一个二维数组中的所有元素
 * @date         : 2024-07-17
 * @version      : 1.0
 * @note         :
 * @author
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main() {
  // 原始数组和翻转后的数组
  int originalArray[5][5] = {{1, 2, 3, 4, 5},
                             {1, 2, 3, 4, 5},
                             {1, 2, 3, 4, 5},
                             {1, 2, 3, 4, 5},
                             {1, 2, 3, 4, 5}};
  int reversedArray[5][5];

  // 翻转数组
  for (int i = 4, i_reversed = 0; i >= 0; i--, i_reversed++) {
    for (int j = 4, j_reversed = 0; j >= 0; j--, j_reversed++) {
      reversedArray[i_reversed][j_reversed] = originalArray[i][j];
    }
  }

  // 输出翻转后的数组
  printf("翻转后的二维数组为：\n");
  for (int i = 0; i < 5; i++) {
    for (int j = 0; j < 5; j++) {
      printf("%d ", reversedArray[i][j]);
    }
    printf("\n");
  }

  return 0;
}
