/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0711/demo4.c
 * @brief        : 获取用户输入的三位数，并输出最大的数字
 *                 输入三个整数，输出其中最大的数值。
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-11 14:15:56
 * @version      : 1.0
 * @note         : 输入示例：123 456 789，输出最大值为789
 * @Copyright    : (c)   2023-2024   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  // 声明变量
  int number1, number2, number3, max;
  
  // 提示用户输入三个数字（用空格分割）
  printf("请任意输入三个数字（用空格分割）：");
  
  // 接收用户输入
  scanf("%d %d %d", &number1, &number2, &number3);
  
  // 求取最大值
  max = number1 > number2 ? number1 : number2;
  max = max > number3 ? max : number3;
  
  // 输出最大值
  printf("最大值是%d\n", max);
  
  return 0;
}
