/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0711/demo2.c
 * @brief        : 小练习：利用关系运算符与随机数，制作一个抽奖小游戏
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-11 11:03:36
 * @version      : 1.0
 * @note         :  10%中一等奖，20%二等奖，30%中三等奖，其余都是安慰剂
 * @Copyright    : (c)   2023-2024   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main(int argc, const char *argv[]) {
  srand(time(NULL));      // 使用当前时间作为随机数种子
  int num = rand() % 100; // 生成一个0~99的随机数

  // 判断中奖情况
  if (num < 10) { // 10%的概率中一等奖
    printf("恭喜您中了一等奖！\n");
  } else if (num < 30) { // 20%的概率中二等奖
    printf("恭喜您中了二等奖！\n");
  } else if (num < 60) { // 30%的概率中三等奖
    printf("恭喜您中了三等奖！\n");
  } else { // 其余概率安慰奖
    printf("很遗憾，您获得安慰奖！\n");
  }

  return 0; // 返回程序执行成功
}
