/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0711/demo1.c
 * @brief        : 小练习：利用求余数和随机数，产生50~100以内的随机数
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-11 09:17:06
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2023-2024   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main(int argc, const char *argv[]) {
  srand(time(NULL));             // 使用当前时间作为随机数种子
  int num = rand();              // 生成一个随机数
  printf("%d\n", 50 + num % 50); // 输出50~100之间的随机数
  return 0;                      // 返回程序执行成功
}
