/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0710/demo1.c
 * @brief        : 演示检测当前系统是大端还是小端存储方式的程序
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-10 10:16:35
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2023-2024   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

/****************************************************************************************************************************************************************
 * @name: main
 * @brief: 主函数，用于检测当前系统的存储方式（大端或小端）
 * @return {*}
 * @date: 2024-07-10 11:00:55
 * @version: 1.0
 * @note:
 *****************************************************************************************************************************************************************/
int main() {
  unsigned short value = 0x1234; // 定义一个无符号短整型变量并初始化为0x1234

  // 打印变量value的内存空间大小
  printf("value的内存空间是：%d个字节\n", sizeof(value));

  // 打印变量value的内存地址
  printf("value的内存地址是：%p\n", (void *)&value);

  // 打印变量value的值（十六进制格式）
  printf("value的内存上的值是：%#x\n", value);

  // 打印value的低地址内存上的值（以字节格式输出）
  printf("value的低地址内存上的值是：0x%hhx\n", (unsigned char)value);

  // 判断当前系统是小端还是大端存储方式并输出
  printf("本地主机是：%s\n", (value & 0x00ff) == 0x34 ? "小端" : "大端");

  return 0;
}
