/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0715/demo4.c
 * @brief        :
 *                 当用户输入5的时候，使用嵌套循环产生下列图案(5行美元符号，每行递增一个字符):
 *                 $
 *                 $$
 *                 $$$
 *                 $$$$
 *                 $$$$$
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-15 11:34:19
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c) 2024-2025 a_23456@foxmail.com
 *                 All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    unsigned int rows;

    // 输入行数
    printf("请输入行数：");
    scanf("%u", &rows);

    // 检查输入是否合法
    if (rows <= 0) {
        printf("行数应为正整数！");
        return 1;
    } else {
        // 打印图案
        for (unsigned int i = 1; i <= rows; i++) {
            for (unsigned int j = 1; j <= i; j++) {
                printf("$");
            }
            printf("\n");
        }
    }

    return 0;
}
