/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0715/demo29.c
 * @brief        : 小练习：输出小写字母 a-z 以及大写字母 Z - A
 *                 输出顺序分两行，第一行输出小写字母 a-z，第二行输出大写字母 Z-A
 *                 使用 ASCII 码进行循环输出
 *                 ASCII 码中：小写字母 a-z 对应的 ASCII 码值为 97-122
 *                              大写字母 Z-A 对应的 ASCII 码值为 90-65
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 14:58:10
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    // 输出小写字母 a-z
    printf("小写字母 a-z:\n");
    for (int i = 'a'; i <= 'z'; i++) {
        printf("%c", i);
    }
    printf("\n");

    // 输出大写字母 Z-A
    printf("大写字母 Z-A:\n");
    for (int i = 'Z'; i >= 'A'; i--) {
        printf("%c", i);
    }
    printf("\n");

    return 0;
}
