/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0715/demo30.c
 * @brief        : 小练习：计算当前系统的整型 int 所能表达的最大值
 *                 使用无符号整数方式计算 int 的最大值，防止溢出
 *                 输出结果应为当前系统 int 的最大值减 1
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 15:02:20
 * @version      : 1.0
 * @note         :
 *                 无特殊说明，句法无错
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  unsigned int max_int_value = 0; // 定义一个无符号整数变量用于存储最大 int 值
  printf("当前系统的整型 int 所能表示的最大值是：%u\n",
         max_int_value - 1); // 输出最大 int 值减 1
  return 0;
}
