/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0715/demo28.c
 * @brief        : 在终端上实现如下输出:
 *                   ABCDEF
 *                   BCDEF
 *                   CDEF
 *                   ..
 *                   F
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-17 14:40:15
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
    char ch;

    // 提示用户输入一个大写英文字符
    printf("请任意输入一个大写英文字符：");
    scanf("%c", &ch);

    // 从 'A' 到用户输入的字符，逐行输出
    for (char i = 'A'; i <= ch; i++) {
        for (char j = i; j <= ch; j++) {
            printf("%c", j);
        }
        printf("\n");
    }

    return 0;
}
