/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0715/demo9.c
 * @brief        :
 *                 小练习：输入一个华氏温度，要求输出摄氏温度。要求结果保留2位小数。
 *                 转换公式为: celsius = 5 * (Fahrenheit - 32) / 9
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main() {
    float Fahrenheit, Celsius;

    // 输入华氏温度
    printf("请输入一个华氏度：");
    scanf("%f", &Fahrenheit);

    // 按照转换公式计算摄氏温度
    Celsius = 5 * (Fahrenheit - 32) / 9;

    // 输出摄氏温度，保留两位小数
    printf("摄氏温度为：%.2f\n", Celsius);

    return 0;
}
