/****************************************************************************************************************************************************************
 * @file         : /Tools/home/user/Code/ClassWork/0726/homework1/main.c
 * @brief        : 作业：随机点名器
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-26 18:52:12
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <unistd.h>

int Random(int min, int max) {
  srand(time(NULL)); // 使用当前时间作为随机数种子
  return (rand() % (max - min + 1)) + min;
}

int main(int argc, const char *argv[]) {

  //   1.把全班同学的名字存储到一个二维字符串数组中
  char *student[100] = {
      "曹文明", "刘善鑫", "涂建泉", "何俊林", "郑坚帆", "魏子盛", "何智兴",
      "曾伟健", "李佳炜", "李义",   "邱伟龙", "李梓艳", "康江源", "曾天宇",
      "马至权", "刘志豪", "谭家龙", "唐金山", "陈钏艺", "谭燕萍", "莫灿苗",
      "赖鹏伦", "黄永锐", "李宇斌", "陈键杭", "苏俊博", "李启培", "罗逸富",
      "陈永钊", "熊春节", "梁桦澍", "王顺祖", "宋维民", "林子乐", "朱锦康",
      "申缘",   "陈建杭", "黄伟涛", "廖泳鑫", "黄满",   "梁宏伟", "刘鑫",
      "卢家吉", "董靖媛", "吴晓正", "杨路坦", "钟少钦", "尹涛",   "唐梓莹",
      "胡世豪", "郭飞宇", "卢果",   "刘浩波", "潘凉昌", "黎粮榜", "周继兴",
      "林锦淼", "黄毅俊", "李伟平", "黄耿武", "林毅鸿", "高湧杰", "李嘉炜",
      "钟清",   "陈棨良", "梁钊杨", "钟震伦", "秦云影", "黄千一", "陈伟源",
      "于佳文", "杨星",   "张光辉", "林明杰", "江文卓", "龚浩",   "周国栋",
      "谭正言", "田冠杰", "严锦彬", "刘威",   "黄鑫",   "黄佳和", "龚文乐",
      "叶智健", "罗梓晴", "骆宏业", "张宇镔"};

  int count = 1;
  long Timer = 0;
  int number;
  while (true) {
    number = Random(0, 7 * 12 + 4 - 1);
    printf("%s\n", student[number]);
    usleep(Timer);
    system("clear");
    if (count == 3) {
      count = 0;
      Timer += 25;
    }
    if (Timer >= 200) {
      break;
    }
    count++;
  }

  printf("请\"%s\"同学回答问题！\n", student[number]);
  return 0;
}
