/****************************************************************************************************************************************************************
 * @file         : /DineSimple/src/UI/ui.c
 * @brief        : UI 层功能实现
 * @author       : a_23456@foxmail.com
 * @date         : 2024-08-16 16:34:51
 * @version      : 1.0
 * @note         : 实现了 UI 层的初始化、更新、屏幕状态切换和开机动画函数
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include "../../include/UI/ui.h"
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/mman.h>
#include <unistd.h>
#include "../../include/Server/server.h"
#include "../../include/Tasks/tasks.h"
#include "../../include/Tools/tools.h"
#include "../../include/UI/ui_callbacks.h"
#include "../../include/UI/ui_tasks.h"

/****************************************************************************************************************************************************************
 * @name: show_boot_animation
 * @brief: 显示开机动画
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @param {const char*} frame_path - 图片帧路径
 * @param {int} frame_count - 图片帧的数量
 * @return: void
 * @note: 该函数负责显示开机动画。开机动画在 UI 初始化时调用。
 *****************************************************************************************************************************************************************/
void show_boot_animation(UI* ui, const char* frame_path, int frame_count) {
  printf("正在加载动画");
  if (!ui || !ui->lcd_mmap) {
    printf("加载动画失败\n");
    exit(EXIT_FAILURE);
  }

  fill_screen_with_color(ui->lcd_mmap, 0x000000);

  const int total_duration_us = 1000000;  // 总动画时间（微秒）
  int frame_duration_us =
      total_duration_us / frame_count;  // 每帧显示时间（微秒）

  for (int i = 0; i < frame_count; i++) {
    // 生成每个帧的文件路径
    char frame_file[256];
    sprintf(frame_file, "%s/animation%d.bmp", frame_path, i);

    // 显示图像帧
    show_bitmap(ui->lcd_mmap, frame_file, 0, 0, 1);
    usleep(frame_duration_us);  // 延迟每帧的显示时间
  }
  printf("动画加载完毕\n");
}

/****************************************************************************************************************************************************************
 * @name: show_WelcomeScreen
 * @brief: 显示欢迎页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示欢迎页，并处理触摸事件和时间显示
 *****************************************************************************************************************************************************************/
void show_WelcomeScreen(UI* ui) {
  // 显示欢迎页的位图
  show_bitmap(ui->lcd_mmap, "./resources/images/WELCOME_SCREEN.bmp", 0, 0, 1);

  // 绑定触摸事件
  bind_touch_event(394, 768, 109, 207, welcome_start_order_callback,
                   ui);  // 开始点餐按钮
  bind_touch_event(394, 768, 209, 307, welcome_user_login_callback,
                   ui);  // 用户登录按钮
  bind_touch_event(394, 768, 309, 407, welcome_shop_login_callback,
                   ui);  // 商家登录按钮

  // 添加右上角时间显示
  create_thread(welcome_display_time_tasks, ui, "welcome_display_time_tasks",
                1);

  // 加载广告
  create_thread(welcome_display_time_tasks, ui, "welcome_display_time_tasks",
                1);
}

/****************************************************************************************************************************************************************
 * @name: show_UserLoginScreen
 * @brief: 显示用户登录页面
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户登录页面
 *****************************************************************************************************************************************************************/
void show_UserLoginScreen(UI* ui) {
  printf("显示用户登录页面\n");
  // TODO: 实现显示用户登录页面逻辑
}

/****************************************************************************************************************************************************************
 * @name: show_MenuScreen
 * @brief: 显示点菜页面
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示点菜页面
 *****************************************************************************************************************************************************************/
void show_MenuScreen(UI* ui) {
  printf("显示点菜页面\n");
  // TODO: 实现显示点菜页面逻辑
}

/****************************************************************************************************************************************************************
 * @name: show_ShoppingCartScreen
 * @brief: 显示用户购物车页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户购物车页
 *****************************************************************************************************************************************************************/
void show_ShoppingCartScreen(UI* ui) {
  printf("显示用户购物车页\n");
  // TODO: 实现显示用户购物车页逻辑
}

/****************************************************************************************************************************************************************
 * @name: show_OrderHistoryScreen
 * @brief: 显示用户点餐记录页
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责显示用户点餐记录页
 *****************************************************************************************************************************************************************/
void show_OrderHistoryScreen(UI* ui) {
  printf("显示用户点餐记录页\n");
  // TODO: 实现显示用户点餐记录页逻辑
}

/****************************************************************************************************************************************************************
 * @name: handle_Exit
 * @brief: 处理退出事件
 * @param {UI*} ui - 指向 UI 结构体的指针
 * @return: void
 * @note: 该函数负责处理退出操作，释放资源
 *****************************************************************************************************************************************************************/
void handle_Exit(UI* ui) {
  destroy_event();                      // 销毁所有触摸事件
  munmap(ui->lcd_mmap, 800 * 480 * 4);  // 释放 LCD 映射内存
  close(ui->input);                     // 关闭触摸屏文件描述符
  fontUnload(ui->font);                 //卸载字体
  exit(EXIT_SUCCESS);                   // 退出程序
}
