/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0718/demo2.c
 * @brief        : 小练习：
                        假设有如下定义：
                        int grid[30][100]
                a.用1种方法表示grid[22][56]的地址
                b.用2种方法表示grid[22][0]的地址
                c.用3种方法表示grid[0][0]的地址
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-18 16:35:23
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
*****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  // 定义一个30行100列的二维数组
  int grid[30][100];

  // 用1种方法表示grid[22][56]的地址
  printf("用1种方法表示grid[22][56]的地址: %p\n", (void *)&(grid[22][56]));

  // 用2种方法表示grid[22][0]的地址
  printf("用2种方法表示grid[22][0]的地址: %p\n", (void *)&grid[22][0]);
  printf("用2种方法表示grid[22][0]的地址: %p\n", (void *)(*(&grid[22])));

  // 用3种方法表示grid[0][0]的地址
  printf("用3种方法表示grid[0][0]的地址: %p\n", (void *)&grid[0][0]);
  printf("用3种方法表示grid[0][0]的地址: %p\n", (void *)(*(&grid[0])));
  printf("用3种方法表示grid[0][0]的地址: %p\n", (void *)grid[0]);

  return 0;
}
