/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0718/demo3.c
 * @brief        : 通过指针访问二维数组元素的示例代码
 *                 该代码演示了如何使用指针不按正常行列顺序访问二维数组的元素
 *                 使用这种方式需要注意指针指向数组元素时的跨行问题
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-18 16:56:32
 * @version      : 1.0
 * @note         : 请谨慎使用这种访问方式，以避免潜在的混淆
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  // 定义一个3行5列的二维数组并初始化
  int array[3][5] = {{1, 2, 3, 4, 5}, {6, 7, 8, 9, 10}, {11, 12, 13, 14, 15}};

  // 将二维数组array的首地址强制转换为指向含有2个整数元素的数组指针
  int(*p)[2] = (void *)array;

  // 打印通过指针p访问到的数组元素值
  printf("%d\n", p[0][0]); // 输出1，对应array[0][0]
  printf("%d\n", p[0][1]); // 输出2，对应array[0][1]
  printf("%d\n", p[1][1]); // 输出4，对应array[0][3]
  printf("%d\n", p[2][1]); // 输出6，对应array[1][1]
  printf("%d\n", p[3][1]); // 输出8，对应array[1][3]

  return 0;
}
