/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0718/homework3.c
 * @brief        : 作业：下面每种情况中*ptr 和*(ptr+2)的值分别是什么？
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-18 20:38:21
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  // 情况一
  int *ptr1; // 一个指针
  int torf1[2][2] = {12, 14,
                     16}; // 一个数组里面有两个元素，这两个元素的类型都是 int[2]
  ptr1 = torf1[0]; // 指向 torf1 数组的第一个元素

  printf("情况一：\n");
  // 打印每个元素的地址
  for (int i = 0; i < 2; i++) {
    for (int j = 0; j < 2; j++) {
      printf("%p ", &torf1[i][j]);
    }
    printf("\n");
  }

  printf("*ptr1 ==> %d\n", *ptr1); // 打印 ptr1 所指向的值，即 torf1[0][0]
  printf("*(ptr1 + 2) ==> %d\n",
         *(ptr1 + 2)); // 打印 ptr1 向后偏移两个元素后的值，即 torf1[1][0]
  printf("(ptr1 + 2) ==> %p\n", (ptr1 + 2)); // 打印 ptr1 + 2 的地址

  // 情况二
  int *ptr2; // 一个指针
  int fort2[2][2] = {
      {12}, {14, 16}}; // 一个数组里面有两个元素，这两个元素的类型都是 int[2]
  ptr2 = fort2[0]; // 指向 fort2 数组的第一个元素

  printf("情况二：\n");
  // 打印每个元素的地址
  for (int i = 0; i < 2; i++) {
    for (int j = 0; j < 2; j++) {
      printf("%p ", &fort2[i][j]);
    }
    printf("\n");
  }

  printf("*ptr2 ==> %d\n", *ptr2); // 打印 ptr2 所指向的值，即 fort2[0][0]
  printf("*(ptr2 + 2) ==> %d\n",
         *(ptr2 + 2)); // 打印 ptr2 向后偏移两个元素后的值，即 fort2[1][1]
  printf("(ptr2 + 2) ==> %p\n", (ptr2 + 2)); // 打印 ptr2 + 2 的地址

  return 0;
}
