/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0718/homework2.c
 * @brief        :
 *                  作业：解释下面的程序并说明原因，ref是哪些数据的地址？ref+1呢？++ref指向什么
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-18 20:31:54
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/
#include <stdio.h>

int main(void) {
  int ref[] = {8, 4, 0, 2}; // 定义一个包含 4 个整型元素的数组
  int *ptr;                 // 定义一个整型指针
  int index;                // 定义一个整型变量作为索引

  // 遍历数组并打印每个元素的值、通过指针解引用的值和每个元素的地址
  for (index = 0, ptr = ref; index < 4; index++, ptr++) {
    printf("%d %d %p\n", ref[index], *ptr, &(ref[index]));
  }

  // 打印 ref+1 的值（即数组第二个元素的地址）
  printf("ref+1 ==> %p\n", ref + 1);

  // 尝试打印 ++ref 的值（这是不允许的，因为 ref
  // 是一个数组名，不能进行自增操作） printf("++ref ==> %p\n", ++ref); //
  // 编译会失败

  return 0;
}
