/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0718/homework6.c
 * @brief        :
 *                 作业：声明一个二维int型数组arr，再声明另一个一维数组指针数组，使该数组的每一个指针分别指向二维数组
 *                 中的每一个元素(即每一个一维数组)，然后利用数组 p2arr 计算数组
 *arr 的和。
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-19 08:55:51
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

int main(int argc, const char *argv[]) {
  // 定义一个3x3的二维数组
  int arr[3][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}};

  // 定义一个一维指针数组，包含9个指向int的指针
  int *p2arr[3 * 3];

  // 将指针数组中的每个指针指向二维数组中的每个元素
  for (int i = 0; i < 3; i++) {
    for (int j = 0; j < 3; j++) {
      p2arr[i * 3 + j] = &arr[i][j];
    }
  }

  // 计算二维数组所有元素的和
  int sum = 0;
  for (int i = 0; i < 3 * 3; i++) {
    sum += *p2arr[i];
  }

  // 输出二维数组的每个元素和总和
  printf("二维数组的元素:\n");
  for (int i = 0; i < 3; i++) {
    for (int j = 0; j < 3; j++) {
      printf("%d ", arr[i][j]);
    }
    printf("\n");
  }
  printf("数组元素的总和: %d\n", sum);

  return 0;
}
