/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0719/demo3.c
 * @brief        : 小练习：编写一个函数，统计一个字符串中包含多少个大写字母
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-19 14:44:02
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include "demo2.c" // 引入之前的 IsUppercase 函数
#include <stdio.h>
#include <string.h>

/****************************************************************************************************************************************************************
 * @name: CountUppercase
 * @brief: 统计字符串中大写字母的个数
 * @param {char*} str 输入的字符串
 * @return {int} 返回大写字母的个数
 * @date: 2024-07-19 14:44:02
 * @version: 1.0
 * @note: 遍历字符串，每遇到一个大写字母计数器加一
 *****************************************************************************************************************************************************************/
int CountUppercase(const char *str) {
  int uppercaseCount = 0; // 大写字母计数器

  // 遍历字符串
  while (*str != '\0') {
    if (IsUppercase(*str)) {
      uppercaseCount++;
    }
    str++;
  }

  return uppercaseCount;
}

int main(int argc, const char *argv[]) {
  // 测试字符串
  char str[1024];
  printf("请输入一些字符串：");
  fgets(str, 1024, stdin);

  // 去掉换行符
  str[strcspn(str, "\n")] = '\0';

  // 打印结果，统计 str 中大写字母的个数
  printf("字符串 \"%s\" 中有 %d 个大写字母！\n", str, CountUppercase(str));

  return 0;
}
