/****************************************************************************************************************************************************************
 * @file         : /Code/Projects/DineSimple/src/main.c
 * @brief        : 主程序文件，负责设备初始化和图像显示
 * @author       : a_23456@foxmail.com
 * @date         : 2024-08-15 19:16:37
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include "../include/device_init.h"
#include "../include/image_display.h"

int* lcd;   // LCD 显示内存映射指针
int input;  // 触摸屏设备文件描述符

int main(int argc, const char* argv[]) {
  /*********局部变量*********/

  /*********END*********/

  /*********设备初始化*********/
  lcd = init_lcd();            // 初始化 LCD 设备
  input = init_touchscreen();  // 初始化触摸屏设备
  /*********END*********/

  /*********图像显示*********/
  display_image(lcd, "./resources/images/clear.bmp", 0, 0,
                1);  // 刷掉默认的开机logo
  /*********END*********/

  /*********开机动画*********/
  // 在此处添加开机动画代码
  /*********END*********/

  /*********线程创建*********/
  // 在此处添加线程创建代码
  /*********END*********/

  /*********资源释放*********/

  /*********END*********/

  return 0;
}
