/****************************************************************************************************************************************************************
 * @file         : /Code/Projects/DineSimple/include/Tasks/tasks.h
 * @brief        : 线程任务的头文件，声明了与线程相关的任务函数
 * @author       : a_23456@foxmail.com
 * @date         : 2024-08-15 20:25:31
 * @version      : 1.0
 * @note         :
 *包含时间获取任务和触摸屏任务的函数声明，以及线程创建函数的声明
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#ifndef TASKS_H
#define TASKS_H



/****************************************************************************************************************************************************************
 * @name: ts_get_time
 * @brief: 获取当前时间，并将其格式化为字符串存储在传入的参数中
 * @param {void*} arg -
 *参数是一个指向字符数组的指针，该字符数组用于存储时间，格式为 char time_str[50]
 * @return {void} - 无返回值
 * @date: 2024-08-16 14:26:28
 * @version: 1.0
 * @note: 此函数会持续运行，每秒更新一次时间
 *****************************************************************************************************************************************************************/
void ts_get_time(void *arg);

/****************************************************************************************************************************************************************
 * @name: ts_task
 * @brief: 读取触摸屏输入事件并处理触摸坐标
 * @param {void*} arg - 参数是一个包含三个元素的数组指针：
 *                      - 第一个元素是触摸屏设备文件描述符 (int)
 *                      - 第二个元素是用于记录触摸屏 X 坐标的地址 (int*)
 *                      - 第三个元素是用于记录触摸屏 Y 坐标的地址 (int*)
 * @return {void} - 无返回值
 * @date: 2024-08-16 14:26:34
 * @version: 1.0
 * @note: 该函数会持续运行，实时处理触摸事件和更新坐标
 *****************************************************************************************************************************************************************/
void ts_task(void *arg);

/****************************************************************************************************************************************************************
 * @name: create_thread
 * @brief: 创建并启动一个线程
 * @param {void (*thread_func)(void *)} thread_func -
 *线程函数的指针，该函数接受一个 void* 类型的参数，并没有返回值
 * @param {void*} arg - 传递给线程函数的参数
 * @return {void} - 无返回值
 * @date: 2024-08-16 14:26:41
 * @version: 1.0
 * @note:
 *该函数使用指定的线程函数和参数创建一个新的线程，并启动该线程。如果线程创建失败，会打印错误信息并终止程序。
 *****************************************************************************************************************************************************************/
void create_thread(void (*thread_func)(void *), void *arg);

#endif // TASKS_H
