/****************************************************************************************************************************************************************
 * @file         : /Tools/home/user/Code/ClassWork/0723/demo4/main.c
 * @brief        : 小练习：定义一个函数指针，指向一个交换两个数据的函数，并利用该指针进行函数回调
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-23 15:26:33
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

/****************************************************************************************************************************************************************
 * @name: swap
 * @brief: 交换两个整数的值
 * @param {int*} num1 指向第一个整数的指针
 * @param {int*} num2 指向第二个整数的指针
 * @return {void}
 * @date: 2024-07-23 15:26:33
 * @version: 1.0
 * @note:
 *****************************************************************************************************************************************************************/
void swap(int *num1, int *num2) {
  int temp = *num1;
  *num1 = *num2;
  *num2 = temp;
}

int main(int argc, const char *argv[]) {
  // 定义一个函数指针，指向swap函数
  void (*funcPtr)(int *, int *);
  funcPtr = swap;

  int num1 = 10, num2 = 20;

  // 交换前输出num1和num2的值
  printf("交换前：num1=%d，num2=%d\n", num1, num2);

  // 使用函数指针调用swap函数
  funcPtr(&num1, &num2);

  // 交换后输出num1和num2的值
  printf("交换后：num1=%d，num2=%d\n", num1, num2);

  return 0;
}
