/****************************************************************************************************************************************************************
 * @file         : /ClassWork/0722/demo1.c
 * @brief        : 小练习：编写一个函数交换两个整数变量的值
 * @author       : a_23456@foxmail.com
 * @date         : 2024-07-22 14:16:26
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Rights Reserved
 *****************************************************************************************************************************************************************/

#include <stdio.h>

/****************************************************************************************************************************************************************
 * @name         : swap
 * @brief        : 交换两个整数变量的值
 * @param {int*} num1 - 指向第一个整数变量的指针
 * @param {int*} num2 - 指向第二个整数变量的指针
 * @return       : 无返回值
 * @date         : 2024-07-22 14:21:38
 * @version      : 1.0
 * @note         :
 *****************************************************************************************************************************************************************/
void swap(int *num1, int *num2) {
  int temp = *num1; // 临时变量保存第一个整数的值
  *num1 = *num2;    // 将第二个整数的值赋给第一个整数
  *num2 = temp;     // 将临时变量的值赋给第二个整数
}

int main(int argc, const char *argv[]) {
  int num1 = 10, num2 = 20;
  // 打印交换前的值
  printf("交换前：num1 = %d, num2 = %d\n", num1, num2);

  // 调用交换函数
  swap(&num1, &num2);

  // 打印交换后的值
  printf("交换后：num1 = %d, num2 = %d\n", num1, num2);

  return 0;
}
