/****************************************************************************************************************************************************************
 * @file         : /Code/Projects/DineSimple/include/device.h
 * @brief        : 设备初始化头文件，定义 LCD 和触摸屏设备的初始化函数
 * @author       : a_23456@foxmail.com
 * @date         : 2024-08-15 15:45:44
 * @version      : 1.0
 * @note         :
 * @Copyright    : (c)   2024-2025   a_23456@foxmail.com   All Right Reserved
 *****************************************************************************************************************************************************************/

#ifndef DEVICE_H
#define DEVICE_H



#if 1
#define FB_PATH "/dev/fb0"                   // LCD 设备路径
#define TOUCHSCREEN_PATH "/dev/input/event0" // 触摸屏设备路径
#else
#define FB_PATH "/dev/ubuntu_lcd"            // 备用 LCD 设备路径
#define TOUCHSCREEN_PATH "/dev/ubuntu_event" // 备用触摸屏设备路径
#endif

/****************************************************************************************************************************************************************
 * @name         : init_lcd
 * @brief        : 初始化 LCD 设备并进行内存映射
 * @return       : 映射到 LCD 设备的内存指针
 * @date         : 2024-08-15 15:50:46
 * @version      : 1.0
 * @note         : 如果打开或映射失败，程序将退出
 *****************************************************************************************************************************************************************/
void *init_lcd(void);

/****************************************************************************************************************************************************************
 * @name         : init_touchscreen
 * @brief        : 初始化触摸屏设备
 * @return       : 触摸屏设备的文件描述符
 * @date         : 2024-08-15 15:51:25
 * @version      : 1.0
 * @note         : 如果打开失败，程序将退出
 *****************************************************************************************************************************************************************/
int init_touchscreen(void);

#endif // DEVICE_H
